In [5]:
import pandas as pd

In [6]:
people = {
    'first' : ['Shah', 'Shah', 'Kawser'],
    'last' : ['Newaz', 'Waliullah', 'Rana'],
    'email' : ['demo1@mail.com', 'demo2@mail.com', 'demo3@mail.com']
}

In [7]:
df = pd.DataFrame(people)

In [8]:
df

    first       last           email
0    Shah      Newaz  demo1@mail.com
1    Shah  Waliullah  demo2@mail.com
2  Kawser       Rana  demo3@mail.com

In [9]:
filt = df['first'] == 'Shah'

In [10]:
df.loc[filt]

  first       last           email
0  Shah      Newaz  demo1@mail.com
1  Shah  Waliullah  demo2@mail.com

In [11]:
df.loc[filt, 'email']

0    demo1@mail.com
1    demo2@mail.com
Name: email, dtype: object

In [12]:
filt = (df['first'] == 'Shah') & (df['last'] == 'Newaz')

In [13]:
df.loc[filt, 'email']

0    demo1@mail.com
Name: email, dtype: object

In [14]:
filt = (df['first'] == 'Shah') | (df['last'] == 'Newaz')

In [15]:
df.loc[filt, 'email']

0    demo1@mail.com
1    demo2@mail.com
Name: email, dtype: object

In [16]:
df.loc[-filt, 'email']

2    demo3@mail.com
Name: email, dtype: object

In [17]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [21]:
df.columns = ['First_Name', 'Last_Name', 'Email_Address']

In [22]:
df

  First_Name  Last_Name   Email_Address
0       Shah      Newaz  demo1@mail.com
1       Shah  Waliullah  demo2@mail.com
2     Kawser       Rana  demo3@mail.com

In [26]:
df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME  LAST_NAME   EMAIL_ADDRESS
0       Shah      Newaz  demo1@mail.com
1       Shah  Waliullah  demo2@mail.com
2     Kawser       Rana  demo3@mail.com

In [28]:
df.columns = df.columns.str.replace('_', ' ')
df

  FIRST NAME  LAST NAME   EMAIL ADDRESS
0       Shah      Newaz  demo1@mail.com
1       Shah  Waliullah  demo2@mail.com
2     Kawser       Rana  demo3@mail.com

In [29]:
df.columns = [x.lower() for x in df.columns]
df

  first name  last name   email address
0       Shah      Newaz  demo1@mail.com
1       Shah  Waliullah  demo2@mail.com
2     Kawser       Rana  demo3@mail.com

In [30]:
df.columns = df.columns.str.replace(' ', '_')
df

  first_name  last_name   email_address
0       Shah      Newaz  demo1@mail.com
1       Shah  Waliullah  demo2@mail.com
2     Kawser       Rana  demo3@mail.com

In [37]:
df.rename(columns={'first_name' : 'Sure_name'})

  Sure_name  last_name   email_address
0      Shah      Newaz  demo1@mail.com
1      Shah  Waliullah  demo2@mail.com
2    Kawser       Rana  demo3@mail.com

In [38]:
df

  first_name  last_name   email_address
0       Shah      Newaz  demo1@mail.com
1       Shah  Waliullah  demo2@mail.com
2     Kawser       Rana  demo3@mail.com